betaflight/betaflight/src/platform/ESP32/bus_spi_esp32.c
/*
 * This file is part of Betaflight.
 *
 * Betaflight is free software. You can redistribute this software
 * and/or modify this software under the terms of the GNU General
 * Public License as published by the Free Software Foundation,
 * either version 3 of the License, or (at your option) any later
 * version.
 *
 * Betaflight is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
 *
 * See the GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public
 * License along with this software.
 *
 * If not, see <http://www.gnu.org/licenses/>.
 */

#include <stdbool.h>
#include <stdint.h>
#include <string.h>

#include "platform.h"

#ifdef USE_SPI

#include "common/maths.h"
#include "common/utils.h"

#include "drivers/bus.h"
#include "drivers/bus_spi.h"
#include "drivers/bus_spi_impl.h"
#include "drivers/dma.h"
#include "drivers/dma_impl.h"
#include "drivers/io.h"
#include "drivers/io_impl.h"
#include "pg/bus_spi.h"

#include "platform/dma.h"

// Undefine SPI0/SPI1 macros before ESP-IDF headers to avoid conflict
// with extern spi_dev_t SPI0/SPI1 in soc/spi_struct.h (included transitively)
#undef SPI0
#undef SPI1

#pragma GCC diagnostic push
#pragma GCC diagnostic ignored "-Wunused-parameter"
#pragma GCC diagnostic ignored "-Wsign-compare"
#include "hal/spi_ll.h"
#include "hal/gpio_ll.h"
#ifdef USE_DMA
#include "hal/gdma_ll.h"
#endif
#pragma GCC diagnostic pop

// Do NOT restore SPI0/SPI1 macros in this file — ESP-IDF's SPI_LL_GET_HW
// references SPI1/SPI2/SPI3 as extern spi_dev_t symbols, and our macros
// would break &SPI1 expansions. Use esp32SpiDev0/1 directly below.

#include "soc/gpio_struct.h"
#ifdef USE_DMA
#include "soc/gdma_channel.h"
#include "esp_rom_lldesc.h"
#endif
#include "esp_rom_gpio.h"
#include "soc/gpio_sig_map.h"

// SPI clock idle edge register lives under misc.ck_idle_edge on modern
// SoCs (S3/C5/P4) and under pin.ck_idle_edge on the original ESP32 (LX6).
#if defined(ESP32S3) || defined(ESP32C5) || defined(ESP32P4)
#define ESP32_SPI_CK_IDLE  misc.ck_idle_edge
#else
#define ESP32_SPI_CK_IDLE  pin.ck_idle_edge
#endif

// APB clock frequency
#define ESP32_APB_CLK_FREQ  80000000

// SPI hardware buffer size in bytes (for polled transfers)
#define SPI_MAX_TRANSFER_SIZE  64

// DMA threshold: use DMA for transfers >= this many bytes
#define SPI_DMA_THRESHOLD  8

// RX descriptor capacity is rounded to a 32-bit boundary, so use Espressif's
// largest four-byte-aligned descriptor payload rather than the raw 12-bit max.
#define SPI_DMA_MAX_DESCRIPTOR_SIZE  4092

// Per-bus storage covers a complete descriptor.  Besides supplying a missing
// TX/RX direction it is used as an RX bounce buffer when a caller supplies an
// address that GDMA cannot access on a 32-bit boundary.
#define SPI_DMA_DUMMY_BUFFER_SIZE  SPI_DMA_MAX_DESCRIPTOR_SIZE

#if defined(ESP32S3)
// For very short full-duplex sensor reads the fixed GDMA setup plus a second
// interrupt costs more CPU time than filling/polling the 64-byte SPI FIFO.
// Sixteen bytes covers the common 8/9/13/14/15-byte gyro bursts while keeping
// longer/background transfers asynchronous on DMA.  A board target may set
// this to zero (or another measured limit) without changing the common driver.
#ifndef ESP32S3_SPI_SHORT_POLLED_MAX_SIZE
#define ESP32S3_SPI_SHORT_POLLED_MAX_SIZE  16
#endif
#endif

// GPIO matrix signal indices for SPI2 (FSPI) and SPI3 (HSPI)
static const struct {
    uint8_t clkOut;
    uint8_t mosiOut;
    uint8_t misoIn;
} spiSignals[] = {
#if defined(ESP32C5)
    // ESP32-C5 exposes only FSPI as a general-purpose master; second slot
    // is left pointing at FSPI as a placeholder until the C5 SPI port lands.
    { FSPICLK_OUT_IDX, FSPID_OUT_IDX,    FSPIQ_IN_IDX    },  // SPI2 (FSPI)
    { FSPICLK_OUT_IDX, FSPID_OUT_IDX,    FSPIQ_IN_IDX    },  // SPI3 placeholder
#elif defined(ESP32P4)
    // ESP32-P4 GPIO signals are all _PAD_ suffixed.
    { SPI2_CK_PAD_OUT_IDX, SPI2_D_PAD_OUT_IDX, SPI2_Q_PAD_IN_IDX },  // SPI2
    { SPI3_CK_PAD_OUT_IDX, SPI3_D_PAD_OUT_IDX, SPI3_Q_PAD_IN_IDX },  // SPI3
#elif defined(ESP32S3)
    { FSPICLK_OUT_IDX, FSPID_OUT_IDX,    FSPIQ_IN_IDX    },  // SPI2 (FSPI)
    { SPI3_CLK_OUT_IDX, SPI3_D_OUT_IDX,  SPI3_Q_IN_IDX   },  // SPI3
#else
    { HSPICLK_OUT_IDX, HSPID_OUT_IDX,    HSPIQ_IN_IDX    },  // SPI2 (HSPI)
    { VSPICLK_OUT_IDX, VSPID_OUT_IDX,    VSPIQ_IN_IDX    },  // SPI3 (VSPI)
#endif
};

#ifdef USE_DMA
// GDMA trigger peripheral IDs for SPI2 and SPI3
static const int spiGdmaPeriphId[] = {
    SOC_GDMA_TRIG_PERIPH_SPI2,  // SPI device 0 -> SPI2
    SOC_GDMA_TRIG_PERIPH_SPI3,  // SPI device 1 -> SPI3
};
#endif

// ESP32-S3 has SPI2 (FSPI) and SPI3 (HSPI) available for general use.
// GPIO matrix allows any pin to be used, but define common defaults.
const spiHardware_t spiHardware[SPIDEV_COUNT] = {
    {
        .device = SPIDEV_0,
        .reg = (spiResource_t *)&esp32SpiDev0,  // Maps to SPI2
        .sckPins = {
#if defined(ESP32S3)
            { DEFIO_TAG_E(PA12) },
            { DEFIO_TAG_E(PA36) },
#else
            { DEFIO_TAG_E(PA14) },  // HSPI default SCK
#endif
        },
        .misoPins = {
#if defined(ESP32S3)
            { DEFIO_TAG_E(PA13) },
            { DEFIO_TAG_E(PA37) },
#else
            { DEFIO_TAG_E(PA12) },  // HSPI default MISO
#endif
        },
        .mosiPins = {
#if defined(ESP32S3)
            { DEFIO_TAG_E(PA11) },
            { DEFIO_TAG_E(PA35) },
#else
            { DEFIO_TAG_E(PA13) },  // HSPI default MOSI
#endif
        },
    },
#if SPIDEV_COUNT > 1
    {
        .device = SPIDEV_1,
        .reg = (spiResource_t *)&esp32SpiDev1,  // Maps to SPI3
        .sckPins = {
#if defined(ESP32S3)
            { DEFIO_TAG_E(PA14) },
            { DEFIO_TAG_E(PA38) },
#else
            { DEFIO_TAG_E(PA18) },  // VSPI default SCK
#endif
        },
        .misoPins = {
#if defined(ESP32S3)
            { DEFIO_TAG_E(PA15) },
            { DEFIO_TAG_E(PA39) },
#else
            { DEFIO_TAG_E(PA19) },  // VSPI default MISO
#endif
        },
        .mosiPins = {
#if defined(ESP32S3)
            { DEFIO_TAG_E(PA16) },
            { DEFIO_TAG_E(PA40) },
#else
            { DEFIO_TAG_E(PA23) },  // VSPI default MOSI
#endif
        },
    },
#endif // SPIDEV_COUNT > 1
};

extern busDevice_t spiBusDevice[SPIDEV_COUNT];

#ifdef USE_DMA
// DMA descriptors for SPI transfers (one TX + one RX per SPI bus).
static lldesc_t dmaTxDesc[SPIDEV_COUNT] __attribute__((aligned(4)));
static lldesc_t dmaRxDesc[SPIDEV_COUNT] __attribute__((aligned(4)));

typedef struct spiDmaDescriptorCache_s {
    const uint8_t *txBuffer;
    uint8_t *rxBuffer;
    uint8_t *rxCopyTarget;
    uint16_t length;
    uint16_t rxCopyLength;
} spiDmaDescriptorCache_t;

static spiDmaDescriptorCache_t dmaDescriptorCache[SPIDEV_COUNT];

// Dummy buffers for DMA when no TX/RX buffer is provided.
// Keep one pair per bus so simultaneous SPI2/SPI3 activity cannot alias them.
static uint8_t dummyTxBuf[SPIDEV_COUNT][SPI_DMA_DUMMY_BUFFER_SIZE] __attribute__((aligned(4)));
static uint8_t dummyRxBuf[SPIDEV_COUNT][SPI_DMA_DUMMY_BUFFER_SIZE] __attribute__((aligned(4)));
#endif

// Map from Betaflight SPI device number (0/1) to ESP-IDF SPI host ID.
// esp32SpiDev0 = 0 -> SPI2_HOST (1), esp32SpiDev1 = 1 -> SPI3_HOST (2)
static spi_host_device_t spiGetHostId(int deviceNum)
{
    return (spi_host_device_t)(deviceNum + 1);
}

static spi_dev_t *spiGetHw(int deviceNum)
{
    return SPI_LL_GET_HW(spiGetHostId(deviceNum));
}

