betaflight/betaflight/src/platform/ESP32/bus_spi_esp32.c
void spiPinConfigure(const struct spiPinConfig_s *pConfig)
{
    for (size_t hwindex = 0; hwindex < ARRAYLEN(spiHardware); hwindex++) {
        const spiHardware_t *hw = &spiHardware[hwindex];

        if (!hw->reg) {
            continue;
        }

        const spiDevice_e device = hw->device;
        spiDevice_t *pDev = &spiDevice[device];

        // First try to match against the known pin table entries
        for (int pindex = 0; pindex < MAX_SPI_PIN_SEL; pindex++) {
            if (pConfig[device].ioTagSck == hw->sckPins[pindex].pin) {
                pDev->sck = hw->sckPins[pindex].pin;
            }
            if (pConfig[device].ioTagMiso == hw->misoPins[pindex].pin) {
                pDev->miso = hw->misoPins[pindex].pin;
            }
            if (pConfig[device].ioTagMosi == hw->mosiPins[pindex].pin) {
                pDev->mosi = hw->mosiPins[pindex].pin;
            }
        }

        // On ESP32 any GPIO can be routed via the GPIO matrix, so accept
        // configured pins even when they don't match a table entry.
        if (!pDev->sck && pConfig[device].ioTagSck) {
            pDev->sck = pConfig[device].ioTagSck;
        }
        if (!pDev->miso && pConfig[device].ioTagMiso) {
            pDev->miso = pConfig[device].ioTagMiso;
        }
        if (!pDev->mosi && pConfig[device].ioTagMosi) {
            pDev->mosi = pConfig[device].ioTagMosi;
        }

        if (pDev->sck) {
            pDev->dev = hw->reg;
            pDev->leadingEdge = false;
        }
    }
}

void spiPreinitRegister(ioTag_t iotag, uint32_t iocfg, uint8_t init)
{
    ioPreinitByTag(iotag, iocfg, init);
}

void spiPreinitByIO(IO_t io)
{
    ioPreinitByIO(io, SPI_IO_CS_HIGH_CFG, PREINIT_PIN_STATE_HIGH);
}

void spiPreinitByTag(ioTag_t tag)
{
    spiPreinitByIO(IOGetByTag(tag));
}

void spiInitDevice(spiDevice_e device)
{
    const spiDevice_t *spi = &spiDevice[device];

    if (!spi->dev) {
        return;
    }

    int deviceNum = SPI_INST((SPI_TypeDef *)spi->dev);
    spi_host_device_t hostId = spiGetHostId(deviceNum);
    spi_dev_t *hw = SPI_LL_GET_HW(hostId);

    // Enable bus clock and reset peripheral
    // The LL macros require __DECLARE_RCC_ATOMIC_ENV to be in scope
    {
        int __DECLARE_RCC_ATOMIC_ENV __attribute__((unused));
        spi_ll_enable_bus_clock(hostId, true);
        spi_ll_reset_register(hostId);
    }

    // Initialize as SPI master
    spi_ll_master_init(hw);

    // Enable full-duplex mode
    hw->user.doutdin = 1;
    hw->user.usr_miso = 1;
    hw->user.usr_mosi = 1;

    // Set default clock: 1 MHz
    spi_ll_master_set_clock(hw, ESP32_APB_CLK_FREQ, 1000000, 128);

    // Apply configuration
    spi_ll_apply_config(hw);

    // Set resource owners
    IOInit(IOGetByTag(spi->sck),  OWNER_SPI_SCK, RESOURCE_INDEX(device));
    IOInit(IOGetByTag(spi->miso), OWNER_SPI_SDI, RESOURCE_INDEX(device));
    IOInit(IOGetByTag(spi->mosi), OWNER_SPI_SDO, RESOURCE_INDEX(device));

    // Configure SCK pin via GPIO matrix
    IO_t sckIO = IOGetByTag(spi->sck);
    if (sckIO) {
        uint32_t pin = IO_Pin(sckIO);
        esp_rom_gpio_pad_select_gpio(pin);
        gpio_ll_output_enable(&GPIO, pin);
        esp_rom_gpio_connect_out_signal(pin, spiSignals[deviceNum].clkOut, false, false);
    }

    // Configure MOSI pin via GPIO matrix
    IO_t mosiIO = IOGetByTag(spi->mosi);
    if (mosiIO) {
        uint32_t pin = IO_Pin(mosiIO);
        esp_rom_gpio_pad_select_gpio(pin);
        gpio_ll_output_enable(&GPIO, pin);
        esp_rom_gpio_connect_out_signal(pin, spiSignals[deviceNum].mosiOut, false, false);
    }

    // Configure MISO pin via GPIO matrix
    IO_t misoIO = IOGetByTag(spi->miso);
    if (misoIO) {
        uint32_t pin = IO_Pin(misoIO);
        esp_rom_gpio_pad_select_gpio(pin);
        gpio_ll_input_enable(&GPIO, pin);
        gpio_ll_pullup_en(&GPIO, pin);
        esp_rom_gpio_connect_in_signal(pin, spiSignals[deviceNum].misoIn, false);
    }
}

void spiInternalResetDescriptors(busDevice_t *bus)
{
    UNUSED(bus);
}

void spiInternalResetStream(dmaChannelDescriptor_t *descriptor)
{
    UNUSED(descriptor);
}

#ifdef USE_DMA
// Interrupt handler for SPI RX DMA completion
FAST_IRQ_HANDLER static void spiRxIrqHandler(dmaChannelDescriptor_t *descriptor)
{
    const extDevice_t *dev = (const extDevice_t *)descriptor->userParam;

    if (!dev) {
        return;
    }

    busDevice_t *bus = dev->bus;

    if (bus->curSegment->negateCS) {
        IOHi(dev->busType_u.spi.csnPin);
    }

    spiInternalStopDMA(dev);

    // ESP32-S3 GDMA requires an aligned RX start address.  Copy from the
    // per-bus bounce buffer before the segment callback consumes the data.
    int deviceNum = SPI_INST((SPI_TypeDef *)bus->busType_u.spi.instance);
    spiDmaDescriptorCache_t *cache = &dmaDescriptorCache[deviceNum];
    if (cache->rxCopyTarget) {
        memcpy(cache->rxCopyTarget, dummyRxBuf[deviceNum], cache->rxCopyLength);
        cache->rxCopyTarget = NULL;
        cache->rxCopyLength = 0;
    }

    spiIrqHandler(dev);
}
#endif

FAST_CODE void spiInternalStopDMA(const extDevice_t *dev)
{
#ifndef USE_DMA
    UNUSED(dev);
#else
    busDevice_t *bus = dev->bus;

    if (!bus->dmaTx || !bus->dmaRx) {
        return;
    }

    int txCh = bus->dmaTx->channel;
    int rxCh = bus->dmaRx->channel;

    // Stop both GDMA channels
    gdma_ll_tx_stop(&GDMA, txCh);
    gdma_ll_rx_stop(&GDMA, rxCh);

    // Disable SPI DMA
    int deviceNum = SPI_INST((SPI_TypeDef *)bus->busType_u.spi.instance);
    spi_dev_t *hw = spiGetHw(deviceNum);
    spi_ll_dma_tx_enable(hw, false);
    spi_ll_dma_rx_enable(hw, false);
#endif
}

FAST_CODE void spiInternalInitStream(const extDevice_t *dev, volatile busSegment_t *segment)
{
#ifndef USE_DMA
    UNUSED(dev);
    UNUSED(segment);
#else
    // ESP32 descriptors are bound immediately before launch.  Keeping the
    // STM32-style per-segment init hook as a no-op avoids a store/load pair in
    // the gyro ISR while preserving the shared bus API.
    UNUSED(dev);
    UNUSED(segment);
#endif
}

