betaflight/betaflight/src/platform/ESP32/bus_spi_esp32.c
FAST_CODE void spiInternalStartDMA(const extDevice_t *dev)
{
#ifndef USE_DMA
    UNUSED(dev);
#else
    busDevice_t *bus = dev->bus;
    int deviceNum = SPI_INST((SPI_TypeDef *)bus->busType_u.spi.instance);
    spi_dev_t *hw = spiGetHw(deviceNum);

    int txCh = bus->dmaTx->channel;
    int rxCh = bus->dmaRx->channel;

    // Pass device pointer to RX ISR via userParam
    bus->dmaRx->userParam = (uint32_t)dev;

    volatile busSegment_t *segment = bus->curSegment;
    int xferLen = segment->len & BUS_SEGMENT_LEN_LENGTH_MASK;

    const uint8_t *txBuffer = segment->u.buffers.txData;
    uint8_t *rxBuffer = segment->u.buffers.rxData;

    const bool hasTx = txBuffer != NULL;
    const bool hasRx = rxBuffer != NULL;
    const bool rxNeedsBounce = hasRx && (((uintptr_t)rxBuffer & 3U) != 0);
    const uint8_t *effectiveTxBuffer = hasTx ? txBuffer : dummyTxBuf[deviceNum];
    uint8_t *effectiveRxBuffer = hasRx && !rxNeedsBounce ? rxBuffer : dummyRxBuf[deviceNum];

    // Reset GDMA channels
    gdma_ll_tx_reset_channel(&GDMA, txCh);
    gdma_ll_rx_reset_channel(&GDMA, rxCh);

    // Reset SPI DMA FIFOs
    spi_ll_dma_tx_fifo_reset(hw);
    spi_ll_dma_rx_fifo_reset(hw);

    // Configure TX DMA descriptor.  The invariant fields (offset, sosf and
    // next link) are zeroed once in spiInitBusDMA(); only fields changed by a
    // transaction or by GDMA are re-armed here.
    lldesc_t *txDesc = &dmaTxDesc[deviceNum];
    lldesc_t *rxDesc = &dmaRxDesc[deviceNum];
    spiDmaDescriptorCache_t *cache = &dmaDescriptorCache[deviceNum];
    const uint16_t rxDmaSize = (xferLen + 3U) & ~3U;

    if (cache->length != xferLen || cache->txBuffer != effectiveTxBuffer) {
        txDesc->size = xferLen;
        txDesc->buf = effectiveTxBuffer;
        cache->txBuffer = effectiveTxBuffer;
    }
    if (cache->length != xferLen || cache->rxBuffer != effectiveRxBuffer) {
        rxDesc->size = rxDmaSize;
        rxDesc->buf = effectiveRxBuffer;
        cache->rxBuffer = effectiveRxBuffer;
    }
    cache->length = xferLen;
    cache->rxCopyTarget = rxNeedsBounce ? rxBuffer : NULL;
    cache->rxCopyLength = rxNeedsBounce ? xferLen : 0;

    txDesc->length = xferLen;
    txDesc->eof = 1;

    // Configure RX DMA descriptor
    rxDesc->length = 0;  // filled by hardware
    rxDesc->eof = 0;

    // Hand ownership over only after all descriptor contents are visible.
    txDesc->owner = 1;
    rxDesc->owner = 1;  // owned by DMA hardware
#if defined(ESP32S3)
    __asm__ volatile ("memw" ::: "memory");
#else
    __asm__ volatile ("" ::: "memory");
#endif

    // Set SPI transfer length
    spi_ll_set_mosi_bitlen(hw, xferLen * 8);
    spi_ll_set_miso_bitlen(hw, xferLen * 8);

    // Enable SPI DMA
    spi_ll_dma_tx_enable(hw, true);
    spi_ll_dma_rx_enable(hw, true);

    // Set descriptor addresses
    gdma_ll_tx_set_desc_addr(&GDMA, txCh, (uint32_t)txDesc);
    gdma_ll_rx_set_desc_addr(&GDMA, rxCh, (uint32_t)rxDesc);

    // Clear any pending RX interrupt
    gdma_ll_rx_clear_interrupt_status(&GDMA, rxCh, GDMA_LL_EVENT_RX_SUC_EOF);

    // Start both DMA channels
    gdma_ll_rx_start(&GDMA, rxCh);
    gdma_ll_tx_start(&GDMA, txCh);

    // Apply SPI config and start the SPI transaction
    spi_ll_apply_config(hw);
    spi_ll_user_start(hw);
#endif
}

FAST_CODE bool spiInternalReadWriteBufPolled(spiResource_t *instance, const uint8_t *txData, uint8_t *rxData, int len)
{
    int deviceNum = SPI_INST((SPI_TypeDef *)instance);
    spi_dev_t *hw = spiGetHw(deviceNum);

    int offset = 0;
    while (offset < len) {
        int chunkLen = MIN(len - offset, SPI_MAX_TRANSFER_SIZE);
        int bitLen = chunkLen * 8;

        // Reset FIFOs
        spi_ll_cpu_tx_fifo_reset(hw);
        spi_ll_cpu_rx_fifo_reset(hw);

        // Set transfer length
        spi_ll_set_mosi_bitlen(hw, bitLen);
        spi_ll_set_miso_bitlen(hw, bitLen);

        // Write TX data into hardware buffer
        if (txData) {
            spi_ll_write_buffer(hw, txData + offset, bitLen);
        } else {
            // Send 0xFF when no TX data (same convention as other platforms)
            uint8_t dummy[SPI_MAX_TRANSFER_SIZE];
            memset(dummy, 0xFF, chunkLen);
            spi_ll_write_buffer(hw, dummy, bitLen);
        }

        // Ensure DMA is disabled for polled transfers
        spi_ll_dma_tx_enable(hw, false);
        spi_ll_dma_rx_enable(hw, false);

        // Apply config and start transfer
        spi_ll_apply_config(hw);
        spi_ll_user_start(hw);

        // Poll for completion
        while (!spi_ll_usr_is_done(hw)) {
            // busy wait
        }

        // Clear the transfer done interrupt flag
        spi_ll_clear_int_stat(hw);

        // Read RX data from hardware buffer
        if (rxData) {
            spi_ll_read_buffer(hw, rxData + offset, bitLen);
        }

        offset += chunkLen;
    }

    return true;
}

FAST_CODE void spiSequenceStart(const extDevice_t *dev)
{
    busDevice_t *bus = dev->bus;
    spiResource_t *instance = bus->busType_u.spi.instance;
    spiDevice_t *spi = &spiDevice[spiDeviceByInstance(instance)];
    bool dmaSafe = dev->useDMA;
    bool shortPolledTransfer = false;
    uint32_t xferLen = 0;
    uint32_t segmentCount = 0;

    bus->initSegment = true;

    // Switch bus speed if needed
    if (dev->busType_u.spi.speed != bus->busType_u.spi.speed) {
        int deviceNum = SPI_INST((SPI_TypeDef *)instance);
        spi_dev_t *hw = spiGetHw(deviceNum);
        uint32_t freq = spiCalculateClock(dev->busType_u.spi.speed);
        spi_ll_master_set_clock(hw, ESP32_APB_CLK_FREQ, freq, 128);
        spi_ll_apply_config(hw);
        bus->busType_u.spi.speed = dev->busType_u.spi.speed;
    }

    // Switch SPI clock polarity/phase if necessary
    if (dev->busType_u.spi.leadingEdge != bus->busType_u.spi.leadingEdge) {
        int deviceNum = SPI_INST((SPI_TypeDef *)instance);
        spi_dev_t *hw = spiGetHw(deviceNum);

        if (dev->busType_u.spi.leadingEdge) {
            // SPI Mode 0: CPOL=0, CPHA=0
            hw->ESP32_SPI_CK_IDLE = 0;    // Clock idle low
            hw->user.ck_out_edge = 0;     // Data clocked on leading edge
        } else {
            // SPI Mode 3: CPOL=1, CPHA=1
            hw->ESP32_SPI_CK_IDLE = 1;    // Clock idle high
            hw->user.ck_out_edge = 1;     // Data clocked on trailing edge
        }
        spi_ll_apply_config(hw);

        bus->busType_u.spi.leadingEdge = dev->busType_u.spi.leadingEdge;
    }

    UNUSED(spi);

    // Count segments and total transfer length
    for (busSegment_t *checkSegment = (busSegment_t *)bus->curSegment; checkSegment->len; checkSegment++) {
        const uint32_t segmentLen = checkSegment->len & BUS_SEGMENT_LEN_LENGTH_MASK;
        segmentCount++;
        xferLen += segmentLen;

        // A single descriptor cannot represent a larger segment.  Larger
        // transactions retain the existing chunked polling fallback.
        if (segmentLen > SPI_DMA_MAX_DESCRIPTOR_SIZE) {
            dmaSafe = false;
        }
    }

#if defined(ESP32S3)
    shortPolledTransfer = ESP32S3_SPI_SHORT_POLLED_MAX_SIZE > 0 &&
        segmentCount == 1 &&
        xferLen <= ESP32S3_SPI_SHORT_POLLED_MAX_SIZE &&
        bus->curSegment->negateCS &&
        bus->curSegment->u.buffers.txData &&
        bus->curSegment->u.buffers.rxData;
#endif

    // Use DMA if possible:
    // - Bus supports DMA (bus->useDMA set by spiInitBusDMA)
    // - Device allows DMA (dev->useDMA)
    // - Multiple segments, or single segment >= threshold, or CS held after last segment
    if (!shortPolledTransfer && bus->useDMA && dmaSafe && ((segmentCount > 1) ||
                                    (xferLen >= SPI_DMA_THRESHOLD) ||
                                    !bus->curSegment[segmentCount].negateCS)) {
        spiProcessSegmentsDMA(dev);
    } else {
        spiProcessSegmentsPolled(dev);
    }
}

