betaflight/betaflight/src/platform/ESP32/bus_spi_esp32.c
uint16_t spiCalculateDivider(uint32_t freq)
{
    if (freq == 0) {
        return 0;
    }

    // Pack the target frequency into the uint16_t divider value.
    // APB clock is 80 MHz; compute a simple integer divider.
    uint32_t divider = (ESP32_APB_CLK_FREQ + freq - 1) / freq;
    if (divider < 1) {
        divider = 1;
    }
    if (divider > 65535) {
        divider = 65535;
    }

    return (uint16_t)divider;
}

uint32_t spiCalculateClock(uint16_t spiClkDivisor)
{
    if (spiClkDivisor == 0) {
        return ESP32_APB_CLK_FREQ;
    }

    return ESP32_APB_CLK_FREQ / spiClkDivisor;
}

void spiInitBusDMA(void)
{
#ifdef USE_DMA
    // Initialise the GDMA hardware
    esp32DmaInit();

    // Fill TX dummy buffer with 0xFF (SPI idle byte convention)
    memset(dummyTxBuf, 0xFF, sizeof(dummyTxBuf));
    memset(dmaTxDesc, 0, sizeof(dmaTxDesc));
    memset(dmaRxDesc, 0, sizeof(dmaRxDesc));
    memset(dmaDescriptorCache, 0, sizeof(dmaDescriptorCache));

    for (uint32_t device = 0; device < SPIDEV_COUNT; device++) {
        busDevice_t *bus = &spiBusDevice[device];

        if (bus->busType != BUS_TYPE_SPI) {
            continue;
        }

        int deviceNum = SPI_INST((SPI_TypeDef *)bus->busType_u.spi.instance);

        // Allocate a GDMA channel for TX
        dmaIdentifier_e txId = dmaGetFreeIdentifier();
        if (txId == DMA_NONE) {
            return;
        }

        // Allocate a GDMA channel for RX
        dmaIdentifier_e rxId = dmaGetFreeIdentifier();
        if (rxId == DMA_NONE) {
            return;
        }

        if (!dmaAllocate(txId, OWNER_SPI_SDO, device + 1) ||
            !dmaAllocate(rxId, OWNER_SPI_SDI, device + 1)) {
            return;
        }

        int txCh = DMA_IDENTIFIER_TO_CHANNEL(txId);
        int rxCh = DMA_IDENTIFIER_TO_CHANNEL(rxId);

        bus->dmaTx = &dmaDescriptors[DMA_CHANNEL_TO_INDEX(txCh)];
        bus->dmaTx->channel = txCh;

        bus->dmaRx = &dmaDescriptors[DMA_CHANNEL_TO_INDEX(rxCh)];
        bus->dmaRx->channel = rxCh;

        // Use the dmaInit fields to cache per-segment config (has TX/RX buffer flags)
        static DMA_InitTypeDef dmaInitTxStore[SPIDEV_COUNT];
        static DMA_InitTypeDef dmaInitRxStore[SPIDEV_COUNT];
        bus->dmaInitTx = &dmaInitTxStore[device];
        bus->dmaInitRx = &dmaInitRxStore[device];

        // Connect GDMA channels to SPI peripheral
        int periphId = spiGdmaPeriphId[deviceNum];
        gdma_ll_tx_connect_to_periph(&GDMA, txCh, GDMA_TRIG_PERIPH_SPI, periphId);
        gdma_ll_rx_connect_to_periph(&GDMA, rxCh, GDMA_TRIG_PERIPH_SPI, periphId);

        // Enable burst mode for better throughput
        gdma_ll_tx_enable_data_burst(&GDMA, txCh, true);
        gdma_ll_tx_enable_descriptor_burst(&GDMA, txCh, true);
        gdma_ll_rx_enable_data_burst(&GDMA, rxCh, true);
        gdma_ll_rx_enable_descriptor_burst(&GDMA, rxCh, true);

        spi_dev_t *hw = spiGetHw(deviceNum);
        spi_ll_dma_set_rx_eof_generation(hw, true);

        // Register RX DMA completion interrupt handler
        dmaSetHandler(rxId, spiRxIrqHandler, 0, 0);

        bus->useDMA = true;
    }
#endif
}

#endif // USE_SPI
